# Сайранов Эльдар ИТ-3 Лабораторная №5

# Задание 1. Шаблоны

### Текст задачи

В класс Дробь, добавить интерфейс на два метода: получение вещественного значения, установка числителя и установка знаменателя. Сгенерировать такую версию дроби, которая будет кэшировать вычисление вещественного значения.
Если раннее в вашем варианте не было Дроби, то создайте сущность Дробь со следующими особенностями:

- Имеет числитель: целое число
- Имеет знаменатель: целое число
- Дробь может быть создана с указанием числителя и знаменателя
- Может вернуть строковое представление вида “числитель/знаменатель”
- Необходимо корректно обрабатывать отрицательные значения. Учтите, что знаменатель не может быть отрицательным.
- Переопределите метод сравнения объектов по состоянию таким образом, чтобы две дроби считались одинаковыми тогда, когда у них одинаковые значения числителя и знаменателя

### Алгоритм решения

```java

```

# Задание 2. Структурные шаблоны

### Текст задачи

**Количество мяуканий.**

Необходимо воспользоваться классом Кот и методом принимающим всех мяукающих из задачи 2.5.4. Необходимо таким образом передать кота в указанный метод, что бы после окончания его работы узнать сколько раз мяукал кот за время его работы. На рисунке показан пример работы. Перед вызовом метода создаем кота, отправляем ссылку на кота в метод, после окончания его работы выводим количество мяуканий на экран. Кота изменять нельзя.

```java
Meowable m = ... // создаем кота
Funs.meowsCare(m);
System.out.println(...) // вывод: кот мяукает 5 раз
```

Если раннее в вашем варианте не было Кота, то создайте
1. Сущность Кот, которая описывается следующим образом:
 - Имеет Имя (строка)
 - Для создания необходимо указать имя кота.
 - Может быть приведен к текстовой форме вида: “кот: Имя”
 - Может помяукать, что приводит к выводу на экран следующего текста: “Имя: мяу!”, вызвать мяуканье можно без параметров.
2. Интерфейс Мяуканье: разработайте метод, который принимает набор объектов способных мяукать и вызывает мяуканье у каждого объекта. Мяукающие объекты должны иметь метод со следующей сигнатурой:

```java
public void meow();
```

### Алгоритм решения

```java

```

# Задание 3. Список

## Задача 5

### Текст задачи

Составить программу, которая удаляет из списка L все элементы с указанным значением.

### Алгоритм решения 

```java

```

# Задание 4. Мап

## Задача 2

### Текст задачи

На городской олимпиаде по информатике участникам было предложено выполнить 3 задания, каждое из которых оценивалось по 25-балльной шкале. Известно, что общее количество участников первого тура олимпиады не превосходит 250 человек. На вход программы подаются сведения о результатах олимпиады. В первой строке вводится количество участников N. Далее следуют N строк, имеющих следующий формат:

**<Фамилия><Имя><Баллы>**

Здесь <Фамилия> – строка, состоящая не более чем из 20 символов;<Имя>– строка, состоящая не более чем из 15 символов; <Баллы> – строка, содержащая три целых числа, разделенных пробелом, соответствующих баллам, полученным участником за каждое задание первого тура. При этом <Фамилия> и <Имя>, <Имя> и <Баллы> разделены одним пробелом. Примеры входных строк:

**Петрова Ольга 25 18 16**
**Калиниченко Иван 14 19 15**

Напишите программу, которая будет выводить на экран фамилию и имя участника, набравшего максимальное количество баллов. Если среди остальных участников есть ученики, набравшие такое же количество баллов, то их фамилии и имена также следует вывести. При этом имена и фамилии можно выводить в произвольном порядке

### Алгоритм решения

```java

```

# Задание 5. Сет 

## Задача 3

### Текст задачи

Файл содержит текст на русском языке. Напечатать в алфавитном порядке все согласные буквы, которые входят ровно в одно слово.

### Алгоритм решения

```java

```

# Задание 6. Очередь

## Задача 4

### Текст задачи

Проверить равенство участка очереди с i-го по j-й элемент (i < j).

### Алгоритм решения

```java

```

# Задание 7. Стрим 

## Задача 1

### Текст задачи

Необходимо написать стрим:

Дан набор объектов типа Point, необходимо взять все Point в разных координатах, убрать с одинаковыми X,Y, отсортировать по X, отрицательные Y сделать положительными и собрать это все в ломаную (объект типа Polyline)

Если раннее в вашем варианте не было задание с классом Point и Polyline, то написать их:

1. Класс Point:
 - Координата Х: число.
 - Координата Y: число.
 - Может возвращать текстовое представление вида “{X;Y}”.
2. Класс Line (Линия), расположенная на двумерной плоскости, которая описывается:
 - Координата начала: Точка
 - Координата конца: Точка
 - Может возвращать текстовое представление вида “Линия от {X1;Y1} до {X2;Y2}”
3. Класс Polyline (Ломаная), которая будет представлять собой ломаную линию. Ломаная линия представляет собой набор следующих характеристик:
 - Имеет массив Точек, через которые линия проходит.
 - Может быть приведена к строковой форме вида “Линия [Т1,T2,…,TN]”, где TN – это результат приведения к строке Точки с номером N

### Алгоритм решения

```java

```

## Задача 2

### Текст задачи

Дан текстовый файл со строками, содержащими имя человека и его номер в следующей форме:

Вася:5
Петя:3
Аня:5

Номера людей могут повторяться. У каких-то людей может не быть номера. Необходимо написать стрим выполняющую следующее: читаются все люди из файла, все имена приводится к нижнему регистру, но с первой буквой в верхнем регистре, убираем из перечня всех людей без номеров, а имена оставшихся группируются по их номеру:

[5:[Вася, Аня], 3:[Петя]]

### Алгоритм решения

```java

```


